leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5748g_portdefs.h
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 *
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with
 * the terms contained in the written license agreement between you and ArcCore,
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as
 * published by the Free Software Foundation and appearing in the file
 * LICENSE.GPL included in the packaging of this file or here
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/
 
#ifndef _MPC5748GPORTDEFS_H
#define _MPC5748GPORTDEFS_H

/* Pad: 0 */
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_0 {512,2} 
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_0 {525,2} 
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_CAN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_0 {701,1} 

/* Pad: 1 */
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_1 {513,2} 
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_CAN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_1 {703,1} 

/* Pad: 2 */
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_ADC PORT_FUNC3 
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_2 {514,2} 
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_2 {584,2} 

/* Pad: 3 */
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_SPI PORT_FUNC3 
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_3 {515,2} 
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_ETH PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_3 {960,1} 

/* Pad: 4 */
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_4 {516,2} 
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_4 {608,2} 
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_4 {717,1} 
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_OTHER3 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_4 {805,1} 

/* Pad: 5 */
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_USB PORT_FUNC4 
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_5 {517,2} 

/* Pad: 6 */
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_6 {518,2} 
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_6 {716,1} 
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_USB PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_USB_PAD_6 {745,1} 

/* Pad: 7 */
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_7 {519,2} 
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_ETH PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_7 {965,1} 

/* Pad: 8 */
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_8 {520,2} 
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_8 {526,2} 
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_8 {715,1} 
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_ETH PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_8 {964,1} 

/* Pad: 9 */
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_9 {521,2} 
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_ETH PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_9 {963,1} 

/* Pad: 10 */
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_LIN PORT_FUNC3 
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_ETH PORT_FUNC4 
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_10 {522,2} 
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_SPI PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_10 {803,1} 
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_10 {968,1} 

/* Pad: 11 */
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_ETH PORT_FUNC3 
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_11 {523,2} 
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_11 {714,1} 
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_USB PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_USB_PAD_11 {766,1} 
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_11 {967,1} 

/* Pad: 12 */
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_12 {540,2} 
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_12 {610,2} 
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER3 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_12 {800,1} 

