leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5748g_portdefs.h
/* Pad: 13 */
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_CAN PORT_FUNC4 
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_13 {541,2} 
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_13 {609,2} 

/* Pad: 14 */
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_14 {512,3} 
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_14 {607,2} 
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER4 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_14 {801,1} 
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER5 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_14 {802,1} 

/* Pad: 15 */
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_15 {513,3} 
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_15 {605,2} 
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_CAN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_15 {700,1} 
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER4 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_15 {801,2} 
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER5 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER5_PAD_15 {802,2} 

/* Pad: 16 */
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_LIN PORT_FUNC3 
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_16 {542,2} 
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_16 {588,2} 

/* Pad: 17 */
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_17 {543,2} 
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_17 {589,2} 
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_CAN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_17 {700,2} 
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_17 {712,1} 

/* Pad: 18 */
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_LIN PORT_FUNC1 
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_18 {542,3} 

/* Pad: 19 */
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_19 {543,3} 
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_19 {592,2} 
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_19 {712,2} 
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_USB PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_USB_PAD_19 {766,2} 

/* Pad: 20 */
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 21 */
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_ETH PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_21 {977,2} 

/* Pad: 22 */
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_ETH PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_22 {976,2} 

/* Pad: 23 */
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_ETH PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_23 {975,2} 

/* Pad: 24 */
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 25 */
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 26 */
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_CAN PORT_FUNC2 
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_PWM PORT_FUNC5 
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_OTHER1 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_26 {613,5} 
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_26 {706,1} 

/* Pad: 27 */
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_27 {515,3} 
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_27 {802,3} 
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_ETH PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_27 {971,2} 

/* Pad: 28 */
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_ETH PORT_FUNC4 
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_28 {516,3} 
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_28 {845,1} 

