leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5748g_portdefs.h
/* Pad: 29 */
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_29 {517,3} 
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_ETH PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_29 {977,1} 

/* Pad: 30 */
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_FLEXRAY PORT_FUNC3 
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_30 {518,3} 
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_ETH PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_30 {975,1} 

/* Pad: 31 */
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_31 {519,3} 
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_ETH PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_31 {973,1} 

/* Pad: 32 */
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_DIO PORT_FUNC0 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_32 {32,1} 

/* Pad: 33 */
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 34 */
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_CAN PORT_FUNC2 
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_34 {606,2} 
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_USB PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_USB_PAD_34 {755,1} 
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_34 {804,1} 

/* Pad: 35 */
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_ADC PORT_FUNC2 
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_35 {607,3} 
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_CAN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_35 {701,2} 
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_35 {704,1} 
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_USB PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_USB_PAD_35 {756,1} 
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_35 {805,2} 

/* Pad: 36 */
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_FLEXRAY PORT_FUNC2 
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_USB PORT_FUNC4 
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_36 {579,2} 
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_CAN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_36 {703,2} 
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_36 {748,1} 
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_SPI PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_36 {803,2} 

/* Pad: 37 */
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_CAN PORT_FUNC2 
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_FLEXRAY PORT_FUNC4 
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_OTHER0 PORT_FUNC5 
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_USB PORT_FUNC6 
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_37 {608,3} 
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_37 {747,1} 

/* Pad: 38 */
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_LIN PORT_FUNC1 
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_38 {576,2} 
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_38 {601,2} 

/* Pad: 39 */
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_39 {577,2} 
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_39 {602,2} 
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_39 {713,1} 

/* Pad: 40 */
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_LIN PORT_FUNC1 
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_40 {515,4} 

/* Pad: 41 */
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_41 {519,4} 
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_41 {591,2} 
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_41 {714,2} 
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_USB PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_USB_PAD_41 {767,2} 

/* Pad: 42 */
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_ADC PORT_FUNC3 
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_LIN PORT_FUNC6 

