leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5748g_portdefs.h
/* Pad: 43 */
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_ADC PORT_FUNC1 
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_43 {585,2} 
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_CAN PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_43 {701,3} 
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_43 {704,2} 

/* Pad: 44 */
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_FLEXRAY PORT_FUNC2 
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_44 {524,2} 
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_SPI PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_44 {806,1} 

/* Pad: 45 */
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_FLEXRAY PORT_FUNC3 
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_45 {525,3} 

/* Pad: 46 */
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_FLEXRAY PORT_FUNC4 
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_CAN PORT_FUNC5 
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_46 {526,3} 
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_46 {590,2} 
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER3 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_46 {807,1} 

/* Pad: 47 */
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_FLEXRAY PORT_FUNC4 
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_47 {527,2} 
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_47 {589,3} 
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER3 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_47 {808,1} 
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_CAN PORT_FUNC7 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_47 {704,7} 

/* Pad: 48 */
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 49 */
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 50 */
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 51 */
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 52 */
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 53 */
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 54 */
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 55 */
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 56 */
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 57 */
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_ETH PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_57 {974,2} 

/* Pad: 58 */
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_ETH PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_58 {973,2} 

/* Pad: 59 */
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 60 */
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_ETH PORT_FUNC4 
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_60 {536,2} 
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_60 {846,1} 

/* Pad: 61 */
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_ETH PORT_FUNC3 
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_61 {537,2} 
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_61 {805,3} 
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_61 {841,1} 

/* Pad: 62 */
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_FLEXRAY PORT_FUNC3 
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_62 {538,2} 
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_ETH PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_62 {976,1} 

