leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5748g_portdefs.h
/* Pad: 63 */
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_FLEXRAY PORT_FUNC3 
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_63 {539,2} 
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_ETH PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_63 {974,1} 

/* Pad: 64 */
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_64 {528,2} 
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_CAN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_64 {705,1} 
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_64 {723,1} 

/* Pad: 65 */
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_CAN PORT_FUNC2 
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_65 {529,2} 

/* Pad: 66 */
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_FLEXRAY PORT_FUNC2 
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_66 {530,2} 
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_USB PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_USB_PAD_66 {744,1} 
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_SPI PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_66 {803,3} 

/* Pad: 67 */
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_67 {531,2} 
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_FLEXRAY PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_FLEXRAY_PAD_67 {736,1} 
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_USB PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_USB_PAD_67 {746,1} 

/* Pad: 68 */
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_FLEXRAY PORT_FUNC3 
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_USB PORT_FUNC5 
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_68 {532,2} 
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_68 {749,1} 
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_68 {804,2} 

/* Pad: 69 */
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_ADC PORT_FUNC3 
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_USB PORT_FUNC5 
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_69 {533,2} 
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_FLEXRAY PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_FLEXRAY_PAD_69 {737,1} 
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_69 {750,1} 
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER3 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_69 {805,4} 

/* Pad: 70 */
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_ADC PORT_FUNC3 
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_OTHER0 PORT_FUNC5 
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_70 {534,2} 

/* Pad: 71 */
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_ADC PORT_FUNC3 
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_OTHER0 PORT_FUNC5 
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_71 {535,2} 

/* Pad: 72 */
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_LIN PORT_FUNC5 
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_72 {534,3} 

/* Pad: 73 */
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_73 {535,3} 
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_CAN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_73 {702,1} 
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_73 {703,3} 

/* Pad: 74 */
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_LIN PORT_FUNC1 
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_74 {578,2} 

