leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5748g_portdefs.h
/* Pad: 75 */
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_75 {536,3} 
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_75 {715,2} 

/* Pad: 76 */
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_76 {567,2} 
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_USB PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_USB_PAD_76 {767,1} 
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_SPI PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_76 {806,2} 
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_ETH PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_76 {970,1} 
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_76 {972,1} 

/* Pad: 77 */
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_77 {568,2} 
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_ETH PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_77 {966,1} 

/* Pad: 78 */
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_USB PORT_FUNC3 
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_78 {569,2} 
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_78 {760,1} 
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_78 {807,2} 

/* Pad: 79 */
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_USB PORT_FUNC4 
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_79 {570,2} 
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_79 {761,1} 
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_79 {808,2} 
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_OTHER4 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_79 {819,1} 

/* Pad: 80 */
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_CAN PORT_FUNC4 
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_80 {522,3} 

/* Pad: 81 */
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_81 {523,3} 
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_81 {824,1} 

/* Pad: 82 */
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_82 {524,3} 
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_82 {808,3} 
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER3 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_82 {825,1} 

/* Pad: 83 */
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_83 {525,4} 
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_83 {826,1} 

/* Pad: 84 */
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_84 {526,4} 

/* Pad: 85 */
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_85 {534,4} 
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_85 {827,1} 

/* Pad: 86 */
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER1 PORT_FUNC5 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER2 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_86 {535,4} 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER3 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_86 {614,4} 
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER4 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_86 {828,1} 

/* Pad: 87 */
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_87 {813,1} 
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_OTHER3 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_87 {829,1} 

