leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5748g_portdefs.h
/* Pad: 88 */
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_PWM PORT_FUNC4 
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_88 {599,2} 

/* Pad: 89 */
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_89 {549,2} 
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_89 {598,2} 
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_CAN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_89 {702,2} 
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER3 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_89 {703,4} 

/* Pad: 90 */
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_90 {550,2} 
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_90 {603,2} 

/* Pad: 91 */
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_91 {551,2} 
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_91 {604,2} 
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_91 {716,2} 

/* Pad: 92 */
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_92 {573,2} 
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_92 {600,2} 

/* Pad: 93 */
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_93 {574,2} 
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_93 {606,3} 
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_93 {717,2} 

/* Pad: 94 */
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_ETH PORT_FUNC4 
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_94 {575,2} 
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_94 {962,1} 

/* Pad: 95 */
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_95 {552,2} 
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_CAN PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_95 {701,4} 
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_95 {704,3} 
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_ETH PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_95 {969,1} 

/* Pad: 96 */
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_ETH PORT_FUNC3 
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_96 {571,2} 

/* Pad: 97 */
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_ETH PORT_FUNC2 
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_97 {572,2} 
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_CAN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_97 {705,2} 
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_97 {961,1} 

/* Pad: 98 */
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_CAN PORT_FUNC3 
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_LIN PORT_FUNC4 
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_98 {559,2} 

/* Pad: 99 */
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_99 {560,2} 
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_99 {585,3} 
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_CAN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_99 {707,1} 
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_OTHER3 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_99 {811,1} 

/* Pad: 100 */
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_LIN PORT_FUNC3 
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_100 {561,2} 
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_100 {810,1} 

/* Pad: 101 */
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_101 {562,2} 
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_101 {586,2} 
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_101 {722,1} 
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_SPI PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_101 {809,1} 

