leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5748g_portdefs.h
/* Pad: 102 */
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_102 {563,2} 
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_102 {587,2} 

/* Pad: 103 */
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_103 {564,2} 
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER3 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_103 {578,3} 
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER4 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_103 {586,3} 
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_103 {718,1} 

/* Pad: 104 */
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_SPI PORT_FUNC3 
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_CAN PORT_FUNC4 
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_104 {565,2} 
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_104 {808,4} 

/* Pad: 105 */
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_105 {566,2} 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_105 {584,3} 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_CAN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_105 {707,2} 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_105 {719,1} 
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER3 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_105 {807,3} 

/* Pad: 106 */
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_USB PORT_FUNC3 
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_106 {536,4} 
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_106 {579,3} 
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_OTHER3 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_106 {762,1} 
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_SPI PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_106 {812,1} 

/* Pad: 107 */
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_USB PORT_FUNC4 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_107 {537,3} 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_OTHER2 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_107 {763,1} 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_OTHER3 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_107 {814,1} 
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_OTHER4 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_107 {820,1} 

/* Pad: 108 */
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_ETH PORT_FUNC4 
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_108 {538,3} 
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_108 {596,2} 

/* Pad: 109 */
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_ETH PORT_FUNC4 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_109 {539,3} 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_109 {597,2} 
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_109 {813,2} 

/* Pad: 110 */
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_USB PORT_FUNC3 
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_110 {548,2} 
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_110 {758,1} 
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_SPI PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_110 {818,1} 

/* Pad: 111 */
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_USB PORT_FUNC3 
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_111 {549,3} 
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_111 {720,1} 
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_111 {759,1} 

