leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5748g_portdefs.h
/* Pad: 138 */
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_138 {605,3} 

/* Pad: 139 */
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_ETH PORT_FUNC2 
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_139 {598,3} 
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_SPI PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_139 {809,2} 
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_139 {842,1} 

/* Pad: 140 */
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_ETH PORT_FUNC3 
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_OTHER1 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_140 {808,5} 
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_140 {811,3} 

/* Pad: 141 */
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_ETH PORT_FUNC3 
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 142 */
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_SPI PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_142 {812,2} 

/* Pad: 143 */
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_143 {814,4} 

/* Pad: 144 */
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_PWM PORT_FUNC4 
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER1 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_144 {602,5} 

/* Pad: 145 */
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_145 {815,1} 

/* Pad: 146 */
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_146 {817,2} 
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_OTHER3 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_146 {820,3} 
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_OTHER4 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_146 {823,2} 

/* Pad: 147 */
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 148 */
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_148 {566,3} 
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_148 {588,3} 
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER3 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_148 {816,1} 

/* Pad: 149 */
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_149 {600,3} 

/* Pad: 150 */
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_150 {601,3} 

/* Pad: 151 */
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_151 {602,3} 

