leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5748g_portdefs.h
/* Pad: 152 */
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_152 {603,3} 

/* Pad: 153 */
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_CAN PORT_FUNC2 
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_153 {565,4} 

/* Pad: 154 */
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_154 {564,3} 
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_CAN PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_154 {704,4} 

/* Pad: 155 */
#define PIN_FUNCTION_REG_155_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_155_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_155_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_155_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_155 {559,3} 

/* Pad: 156 */
#define PIN_FUNCTION_REG_156_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_156_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_156_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_156 {558,3} 
#define PIN_FUNCTION_REG_156_PORT_PIN_MODE_CAN PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_156 {702,3} 

/* Pad: 157 */
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_157 {563,3} 
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_CAN PORT_FUNC5 
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_OTHER2 PORT_FUNC5 
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_OTHER4 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_157 {829,2} 

/* Pad: 158 */
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_SPI PORT_FUNC3 
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_OTHER2 PORT_FUNC5 
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_PWM PORT_FUNC6 
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_OTHER3 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_158 {562,3} 
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_OTHER4 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_158 {828,2} 

/* Pad: 159 */
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_159 {561,3} 
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_CAN PORT_FUNC6 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_159 {701,6} 
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_OTHER2 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_159 {703,5} 

/* Pad: 160 */
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_PWM PORT_FUNC4 
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_160 {560,3} 
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_160 {827,2} 

/* Pad: 161 */
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_161 {549,4} 
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_161 {590,3} 
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_CAN PORT_FUNC6 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_161 {704,6} 

/* Pad: 162 */
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_162 {550,4} 
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_162 {591,3} 

/* Pad: 163 */
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_163 {548,3} 
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_OTHER3 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_163 {551,4} 
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_OTHER4 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_163 {592,3} 
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_CAN PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_163 {705,3} 
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_LIN PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_163 {720,3} 

