leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5748g_portdefs.h
/* Pad: 164 */
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_OTHER1 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_164 {549,5} 
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_164 {593,3} 

/* Pad: 165 */
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_165 {552,4} 
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_165 {594,3} 
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_CAN PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_165 {702,4} 
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_LIN PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_165 {714,3} 

/* Pad: 166 */
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_166 {553,4} 
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_166 {595,3} 

/* Pad: 167 */
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_167 {554,3} 
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_167 {596,3} 
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_CAN PORT_FUNC6 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_167 {703,6} 
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_LIN PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_167 {715,3} 

/* Pad: 168 */
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_LIN PORT_FUNC2 
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_168 {555,3} 
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_168 {597,3} 

/* Pad: 169 */
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_169 {577,4} 
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_169 {727,2} 
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_SPI PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_169 {812,3} 

/* Pad: 170 */
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_LIN PORT_FUNC3 
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_OTHER0 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_170 {578,5} 

/* Pad: 171 */
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_LIN PORT_FUNC3 
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_OTHER0 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_171 {579,5} 
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_OTHER1 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_171 {813,5} 

/* Pad: 172 */
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_172 {512,4} 
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_172 {726,2} 
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_OTHER1 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_172 {814,5} 

/* Pad: 173 */
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_PWM PORT_FUNC4 
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_OTHER2 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_173 {513,4} 
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_CAN PORT_FUNC7 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_173 {703,7} 
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_OTHER3 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_173 {816,2} 

/* Pad: 174 */
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_PWM PORT_FUNC4 
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_174 {514,3} 
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_174 {817,3} 

/* Pad: 175 */
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_LIN PORT_FUNC3 
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_OTHER0 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_175 {515,5} 
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_175 {815,2} 
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_175 {821,2} 

/* Pad: 176 */
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_PWM PORT_FUNC4 
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_OTHER2 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_176 {516,4} 
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_176 {725,2} 

/* Pad: 177 */
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_ADC PORT_FUNCADC 

