leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5748g_portdefs.h
/* Pad: 178 */
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_USB PORT_FUNC2 
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_SPI PORT_FUNC3 
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_178 {764,2} 

/* Pad: 179 */
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_USB PORT_FUNC2 
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_SPI PORT_FUNC3 
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_179 {763,2} 

/* Pad: 180 */
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_USB PORT_FUNC2 
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_SPI PORT_FUNC3 
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_180 {762,2} 

/* Pad: 181 */
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_USB PORT_FUNC2 
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_SPI PORT_FUNC3 
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_181 {761,2} 

/* Pad: 182 */
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_USB PORT_FUNC2 
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_182 {760,2} 

/* Pad: 183 */
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_USB PORT_FUNC2 
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_183 {607,4} 
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_183 {759,2} 

/* Pad: 184 */
#define PIN_FUNCTION_REG_184_PORT_PIN_MODE_DIO PORT_FUNC0 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_184 {184,1} 
#define PIN_FUNCTION_REG_184_PORT_PIN_MODE_USB PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_USB_PAD_184 {755,2} 

/* Pad: 185 */
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_USB PORT_FUNC2 
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_SPI PORT_FUNC3 

/* Pad: 186 */
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_USB PORT_FUNC2 
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_SPI PORT_FUNC3 
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_186 {765,2} 
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_OTHER2 PORT_FUNC6 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_186 {805,6} 

/* Pad: 187 */
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_USB PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_USB_PAD_187 {757,2} 
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_SPI PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_187 {803,5} 

/* Pad: 188 */
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_SPI PORT_FUNC2 
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_USB PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_USB_PAD_188 {756,2} 
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_188 {804,4} 

/* Pad: 189 */
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_USB PORT_FUNC2 
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_189 {606,4} 
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_189 {758,2} 

/* Pad: 190 */
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_OTHER1 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_190 {525,5} 

/* Pad: 191 */
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_OTHER1 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_191 {512,5} 

/* Pad: 192 */
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 193 */
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 194 */
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 195 */
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_ETH PORT_FUNC2 
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_195 {843,1} 

/* Pad: 196 */
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_ETH PORT_FUNC2 
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_OTHER1 PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_196 {847,1} 

/* Pad: 197 */
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 198 */
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

