leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5748g_portdefs.h
/* Pad: 199 */
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_199_PORT_PIN_MODE_OTHER0 PORT_FUNC1 

/* Pad: 200 */
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_200_PORT_PIN_MODE_ADC PORT_FUNC3 

/* Pad: 201 */
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_201_PORT_PIN_MODE_ADC PORT_FUNC2 

/* Pad: 202 */
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_202_PORT_PIN_MODE_ADC PORT_FUNC2 

/* Pad: 203 */
#define PIN_FUNCTION_REG_203_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_203_PORT_PIN_MODE_CAN PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_203 {706,3} 
#define PIN_FUNCTION_REG_203_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_203 {724,1} 

/* Pad: 204 */
#define PIN_FUNCTION_REG_204_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_204_PORT_PIN_MODE_LIN PORT_FUNC1 
#define PIN_FUNCTION_REG_204_PORT_PIN_MODE_CAN PORT_FUNC2 

/* Pad: 205 */
#define PIN_FUNCTION_REG_205_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_205_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_205_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 206 */
#define PIN_FUNCTION_REG_206_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_206_PORT_PIN_MODE_OTHER0 PORT_FUNC1 
#define PIN_FUNCTION_REG_206_PORT_PIN_MODE_ADC PORT_FUNCADC 

/* Pad: 207 */
#define PIN_FUNCTION_REG_207_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_207_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_207_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_207_PORT_PIN_MODE_OTHER0 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_207 {606,5} 

/* Pad: 208 */
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_208_PORT_PIN_MODE_OTHER0 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_208 {607,5} 

/* Pad: 209 */
#define PIN_FUNCTION_REG_209_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_209_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_209_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_209_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_209 {608,4} 

/* Pad: 210 */
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_210_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_210 {609,3} 

/* Pad: 211 */
#define PIN_FUNCTION_REG_211_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_211_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_211_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_211_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_211 {610,3} 

/* Pad: 212 */
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_212_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_212 {611,2} 

/* Pad: 213 */
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_213_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_213 {612,2} 

/* Pad: 214 */
#define PIN_FUNCTION_REG_214_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_214_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_214_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_214_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_214 {613,2} 

/* Pad: 215 */
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_215_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_215 {614,2} 

/* Pad: 216 */
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_216 {568,3} 
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_OTHER3 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_216 {613,3} 
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_OTHER4 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER4_PAD_216 {615,2} 
#define PIN_FUNCTION_REG_216_PORT_PIN_MODE_CAN PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_216 {705,4} 

/* Pad: 217 */
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_CAN PORT_FUNC3 
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_217 {567,3} 
#define PIN_FUNCTION_REG_217_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_217 {612,3} 

/* Pad: 218 */
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_ADC PORT_FUNCADC 
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_218 {566,4} 
#define PIN_FUNCTION_REG_218_PORT_PIN_MODE_OTHER2 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_218 {611,3} 

/* Pad: 219 */
#define PIN_FUNCTION_REG_219_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_219_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_219_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_219_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_219 {557,3} 

/* Pad: 220 */
#define PIN_FUNCTION_REG_220_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_220_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_220_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_220 {556,3} 
#define PIN_FUNCTION_REG_220_PORT_PIN_MODE_CAN PORT_FUNC7 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_220 {701,7} 

