leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5748g_portdefs.h
/* Pad: 221 */
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_221_PORT_PIN_MODE_OTHER0 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_221 {542,5} 

/* Pad: 222 */
#define PIN_FUNCTION_REG_222_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_222_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_222_PORT_PIN_MODE_OTHER0 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_222 {543,5} 
#define PIN_FUNCTION_REG_222_PORT_PIN_MODE_CAN PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_222 {700,3} 

/* Pad: 223 */
#define PIN_FUNCTION_REG_223_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_223_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_223_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_223 {605,4} 

/* Pad: 224 */
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_LIN PORT_FUNC3 
#define PIN_FUNCTION_REG_224_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_224 {604,4} 

/* Pad: 225 */
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_225 {603,4} 
#define PIN_FUNCTION_REG_225_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_225 {724,2} 

/* Pad: 226 */
#define PIN_FUNCTION_REG_226_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_226_PORT_PIN_MODE_LIN PORT_FUNC1 
#define PIN_FUNCTION_REG_226_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_226_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_226 {602,4} 

/* Pad: 227 */
#define PIN_FUNCTION_REG_227_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_227_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_227_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_227 {601,4} 
#define PIN_FUNCTION_REG_227_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_227 {725,1} 

/* Pad: 228 */
#define PIN_FUNCTION_REG_228_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_228_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_228_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_228 {548,4} 

/* Pad: 229 */
#define PIN_FUNCTION_REG_229_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_229_PORT_PIN_MODE_LIN PORT_FUNC1 
#define PIN_FUNCTION_REG_229_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_229_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_229 {600,4} 

/* Pad: 230 */
#define PIN_FUNCTION_REG_230_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_230_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_230_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_230 {599,4} 
#define PIN_FUNCTION_REG_230_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_230 {726,1} 

/* Pad: 231 */
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_LIN PORT_FUNC1 
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_231_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_231 {598,4} 

/* Pad: 232 */
#define PIN_FUNCTION_REG_232_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_232_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_232_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_232 {597,4} 
#define PIN_FUNCTION_REG_232_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_232 {727,1} 

/* Pad: 233 */
#define PIN_FUNCTION_REG_233_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_233_PORT_PIN_MODE_LIN PORT_FUNC1 
#define PIN_FUNCTION_REG_233_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_233_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_233 {596,4} 

/* Pad: 234 */
#define PIN_FUNCTION_REG_234_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_234_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_234_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_234 {595,4} 
#define PIN_FUNCTION_REG_234_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_234 {728,1} 

/* Pad: 235 */
#define PIN_FUNCTION_REG_235_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_235_PORT_PIN_MODE_LIN PORT_FUNC1 
#define PIN_FUNCTION_REG_235_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_235_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_235 {594,4} 

/* Pad: 236 */
#define PIN_FUNCTION_REG_236_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_236_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_236_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_236 {593,4} 
#define PIN_FUNCTION_REG_236_PORT_PIN_MODE_LIN PORT_FUNC1 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_236 {729,1} 

/* Pad: 237 */
#define PIN_FUNCTION_REG_237_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_237_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_237_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_237_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_237 {592,4} 

/* Pad: 238 */
#define PIN_FUNCTION_REG_238_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_238_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_238_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_238 {591,4} 
#define PIN_FUNCTION_REG_238_PORT_PIN_MODE_CAN PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_238 {706,4} 

/* Pad: 239 */
#define PIN_FUNCTION_REG_239_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_239_PORT_PIN_MODE_CAN PORT_FUNC1 
#define PIN_FUNCTION_REG_239_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_239_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_239 {590,4} 

/* Pad: 240 */
#define PIN_FUNCTION_REG_240_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_240_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_240_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_240 {589,4} 
#define PIN_FUNCTION_REG_240_PORT_PIN_MODE_CAN PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_240 {707,3} 

