leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5748g_portdefs.h
/* Pad: 241 */
#define PIN_FUNCTION_REG_241_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_241_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_241_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_241 {588,4} 
#define PIN_FUNCTION_REG_241_PORT_PIN_MODE_SPI PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_241 {827,3} 

/* Pad: 242 */
#define PIN_FUNCTION_REG_242_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_242_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_242_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_242_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_242 {587,4} 
#define PIN_FUNCTION_REG_242_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_242 {829,3} 

/* Pad: 243 */
#define PIN_FUNCTION_REG_243_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_243_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_243_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_243_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_243 {586,4} 
#define PIN_FUNCTION_REG_243_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_243 {828,3} 

/* Pad: 244 */
#define PIN_FUNCTION_REG_244_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_244_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_244_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_244_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_244 {585,4} 

/* Pad: 245 */
#define PIN_FUNCTION_REG_245_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_245_PORT_PIN_MODE_LIN PORT_FUNC1 
#define PIN_FUNCTION_REG_245_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_245_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_245 {584,4} 

/* Pad: 246 */
#define PIN_FUNCTION_REG_246_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_246_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_246_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_246_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_246 {615,3} 

/* Pad: 247 */
#define PIN_FUNCTION_REG_247_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_247_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_247_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_247 {614,3} 
#define PIN_FUNCTION_REG_247_PORT_PIN_MODE_SPI PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_247 {815,3} 

/* Pad: 248 */
#define PIN_FUNCTION_REG_248_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_248_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_248_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_248_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_248 {613,4} 

/* Pad: 249 */
#define PIN_FUNCTION_REG_249_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_249_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_249_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_249_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_249 {612,4} 
#define PIN_FUNCTION_REG_249_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_249 {825,2} 

/* Pad: 250 */
#define PIN_FUNCTION_REG_250_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_250_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_250_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_250 {611,4} 
#define PIN_FUNCTION_REG_250_PORT_PIN_MODE_SPI PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_250 {824,2} 

/* Pad: 251 */
#define PIN_FUNCTION_REG_251_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_251_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_251_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_251_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_251 {610,4} 
#define PIN_FUNCTION_REG_251_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_251 {826,2} 

/* Pad: 252 */
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_USB PORT_FUNC4 
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_LIN PORT_FUNC5 
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_252 {572,3} 
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_252 {750,2} 
#define PIN_FUNCTION_REG_252_PORT_PIN_MODE_OTHER3 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER3_PAD_252 {820,4} 

/* Pad: 253 */
#define PIN_FUNCTION_REG_253_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_253_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_253_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_253_PORT_PIN_MODE_USB PORT_FUNC3 
#define PIN_FUNCTION_REG_253_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_253 {571,3} 
#define PIN_FUNCTION_REG_253_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_253 {729,2} 
#define PIN_FUNCTION_REG_253_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_253 {749,2} 

/* Pad: 254 */
#define PIN_FUNCTION_REG_254_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_254_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_254_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_254_PORT_PIN_MODE_USB PORT_FUNC3 
#define PIN_FUNCTION_REG_254_PORT_PIN_MODE_LIN PORT_FUNC4 
#define PIN_FUNCTION_REG_254_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_254 {570,3} 
#define PIN_FUNCTION_REG_254_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_254 {748,2} 
#define PIN_FUNCTION_REG_254_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_254 {819,2} 

/* Pad: 255 */
#define PIN_FUNCTION_REG_255_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_255_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_255_PORT_PIN_MODE_USB PORT_FUNC2 
#define PIN_FUNCTION_REG_255_PORT_PIN_MODE_OTHER0 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_255 {569,3} 
#define PIN_FUNCTION_REG_255_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_255 {747,2} 
#define PIN_FUNCTION_REG_255_PORT_PIN_MODE_SPI PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_255 {818,2} 

/* Pad: 256 */
#define PIN_FUNCTION_REG_256_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_256_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_256_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_256_PORT_PIN_MODE_USB PORT_FUNC3 
#define PIN_FUNCTION_REG_256_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_256 {609,4} 

