leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5748g_portdefs.h
/* Pad: 257 */
#define PIN_FUNCTION_REG_257_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_257_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_257_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_257_PORT_PIN_MODE_OTHER0 PORT_FUNC5 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_257 {608,5} 
#define PIN_FUNCTION_REG_257_PORT_PIN_MODE_USB PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_USB_PAD_257 {744,2} 
#define PIN_FUNCTION_REG_257_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_257 {802,4} 

/* Pad: 258 */
#define PIN_FUNCTION_REG_258_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_258_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_258_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_258_PORT_PIN_MODE_OTHER0 PORT_FUNC6 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_258 {607,6} 
#define PIN_FUNCTION_REG_258_PORT_PIN_MODE_USB PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_USB_PAD_258 {745,2} 
#define PIN_FUNCTION_REG_258_PORT_PIN_MODE_OTHER1 PORT_FUNC3 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_258 {801,3} 

/* Pad: 259 */
#define PIN_FUNCTION_REG_259_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_259_PORT_PIN_MODE_PWM PORT_FUNC1 
#define PIN_FUNCTION_REG_259_PORT_PIN_MODE_OTHER0 PORT_FUNC6 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_259 {606,6} 
#define PIN_FUNCTION_REG_259_PORT_PIN_MODE_USB PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_USB_PAD_259 {746,2} 
#define PIN_FUNCTION_REG_259_PORT_PIN_MODE_SPI PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_259 {800,2} 

/* Pad: 260 */
#define PIN_FUNCTION_REG_260_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_260_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_260_PORT_PIN_MODE_PWM PORT_FUNC2 
#define PIN_FUNCTION_REG_260_PORT_PIN_MODE_USB PORT_FUNC3 
#define PIN_FUNCTION_REG_260_PORT_PIN_MODE_OTHER0 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_260 {576,4} 
#define PIN_FUNCTION_REG_260_PORT_PIN_MODE_OTHER1 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_260 {754,2} 

/* Pad: 261 */
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_USB PORT_FUNC4 
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_261 {575,4} 
#define PIN_FUNCTION_REG_261_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_261 {753,2} 

/* Pad: 262 */
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_USB PORT_FUNC4 
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_262 {574,4} 
#define PIN_FUNCTION_REG_262_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_262 {752,2} 

/* Pad: 263 */
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_DIO PORT_FUNC0 
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_SPI PORT_FUNC1 
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_OTHER0 PORT_FUNC2 
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_PWM PORT_FUNC3 
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_USB PORT_FUNC4 
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_OTHER1 PORT_FUNC4 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_263 {573,4} 
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_LIN PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_263 {728,2} 
#define PIN_FUNCTION_REG_263_PORT_PIN_MODE_OTHER2 PORT_FUNC2 
#define INPUT_SELECT_PORT_PIN_MODE_OTHER2_PAD_263 {751,2} 


#endif  /* _MPC5748GPORTDEFS_H*/ 
